# Intro to SQL

## Why use SQL?

- Extract data
- Find the data you want
- Write code to modify the data
- Store data in a structure that can easily be viewed and edited

## Client/Server Model

Client-server model is a distributed application structure that partitions tasks or workloads between the providers of a resource or service, called servers, and service requesters, called clients.

## What are databases and why use them 

Databases are the best way to structure data 

Tables are stored within databases. For example, the “invoices” table lives within the ap database.

## SQL key terms

- SQL: Structured Query Language
- RDBMS: relational database management system
- DML: Data Manipulation Language 
- DDL: Data Definition Language

Data definition language (DDL) is a data manipulation language (this is as opposed to a data manipulation language DML). 

DML: data in the database
DDL: work with objects in the database

## What is RDBMS?

RDBMS stands for Relational Database Management System. RDBMS is the basis for SQL, and for all modern database systems like MS SQL Server, IBM DB2, Oracle, MySQL, and Microsoft Access.

The data in an RDBMS is stored in database objects which are called as tables. This table is basically a collection of related data entries and it consists of numerous columns and rows.

Every table is broken up into smaller entities called fields. The fields that would exist in a CUSTOMERS table consist of ID, NAME, AGE, ADDRESS and SALARY.

A record is also called as a row of data is each individual entry that exists in a table. 

A record is a horizontal entity in a table.

A column is a vertical entity in a table that contains all information associated with a specific field in a table.

## Stored procedures

Stored Procedures are created to perform one or more DML operations on Database. It is nothing but the group of SQL statements that accepts some input in the form of parameters and performs some task and may or may not returns a value. 

    CREATE or REPLACE PROCEDURE name(parameters)
    IS
    variables;
    BEGIN
    //statements;
    END;


The most important part is parameters. Parameters are used to pass values to the Procedure. 

### 3 different types of parameters
 
- IN: 
This is the Default Parameter for the procedure. It always receives the values from calling program.
- OUT: 
This parameter always sends the values to the calling program.
- IN OUT: 
This parameter performs both the operations. It Receives value from as well as sends the values to the calling program.

# Getting started

## Create a new database

	CREATE DATABASE spotify

## Use a database

Switch to the database using the USE statement:


    USE spotify;

## Show databases currently in the server 

	SHOW DATABASES;

Display the current databases available on the server using the SHOW DATABASES statement.

## Show tables in selected database

	SHOW TABLES;

## Show columns in selected table

	SHOW COLUMNS FROM table_name;

### MySQL data types

Data types are used to provide rules for data for particular columns. 

A data type deals with the way values are stored in a column for the length allocated for a column and whether values such as alphanumeric, numeric, and date and time data are allowed. 

There is a data type for every possible bit or combination of data that can be stored in a particular database. 


#### Numeric

- bigint
- smallint
- decimal
- int

#### Character

Stores text information. 

- char: Character data of fixed-size
- varchar: Character data types that are variable-size
    varchar(255)
- text

#### Boolean

#### Datetime

#### Data Structures

- JSON

JavaScript Object Notation (JSON). JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax. It is commonly used for transmitting data in web applications (e.g., sending some data from the server to the client, so it can be displayed on a web page, or vice versa).

JSON is a text-based data format following JavaScript object syntax, which was popularized by Douglas Crockford. Even though it closely resembles JavaScript object literal syntax, it can be used independently from JavaScript, and many programming environments feature the ability to read (parse) and generate JSON.

JSON exists as a string — useful when you want to transmit data across a network. It needs to be converted to a native JavaScript object when you want to access the data. This is not a big issue —  JavaScript provides a global JSON object that has methods available for converting between the two.



[More about JSON here](https://developer.mozilla.org/en-US/docs/Learn/JavaScript/Objects/JSON)


- Arrays 

In computer science, an array data structure, or simply an array, is a data structure consisting of a collection of elements (values or variables), each identified by at least one array index or key. An array is stored such that the position of each element can be computed from its index tuple by a mathematical formula.

The simplest type of data structure is a linear array, also called one-dimensional array.

### Contraints


Constraints are the rules enforced on data columns on a table. These are used to limit the type of data that can go into a table. This ensures the accuracy and reliability of the data in the database.

Constraints can either be column level or table level. Column level constraints are applied only to one column whereas, table level constraints are applied to the entire table.

Following are some of the most commonly used constraints available in SQL −

NOT NULL Constraint − Ensures that a column cannot have a NULL value.

DEFAULT Constraint − Provides a default value for a column when none is specified.

UNIQUE Constraint − Ensures that all the values in a column are different.

PRIMARY Key − Uniquely identifies each row/record in a database table.

FOREIGN Key − Uniquely identifies a row/record in any another database table.

CHECK Constraint − The CHECK constraint ensures that all values in a column satisfy certain conditions.

INDEX − Used to create and retrieve data from the database very quickly.

#### Normalization
A formal process you can use to separate data in data structure into related tables. Reduces data redundancy which can cause storage and maintenance problems 
The process of taking a raw database and breaking it into a logical table structure
Normalization is a process of reducing redundancies of data in a database. 
A technique that is used when designing and redesigning a database, normalization optimally designs a database to reduce redundant data.
A database that is not normalized might include data that is contained in one or more tables for no apparent reason. 
This could be bad for security reasons, disk space usage, speed of queries, efficiency of database updates, and, maybe most important, data integrity.

The End User’s Needs
The needs of the end user should be one of the top considerations when designing a database. Remember that the end user is the person who ultimately uses the database. 

There should be ease of use through the user’s front-end tool (a client program that enables a user access to a database), but this, along with optimal performance, cannot be achieved if the user’s needs are not considered.

Some user-related design considerations include the following:
What data should be stored in the database?
How does the user access the database?
What privileges does the user require?
How should the data be grouped in the database?
What data is the most commonly accessed?
How is all data related in the database?
What measures should be taken to ensure accurate data?
What measures can be taken to reduce redundancy of data?
What measures can be taken to ensure ease of use for the end user who is maintaining the data?


Unnormalized data structure is when a table contains information about two or more entities 


Denormalization might involve recombining separate tables or creating duplicate data within tables to reduce the number of tables that need to be joined to retrieve the requested data, which results in less I/O and CPU time. This is normally advantageous in larger data warehousing applications in which aggregate calculations are made across millions of rows of data within tables.

There are costs to denormalization, however. Data redundancy is increased in a denormalized database, which can improve performance but requires more extraneous efforts to keep track of related data. Application coding renders more complications because the data has been spread across various tables and might be more difficult to locate. In addition, referential integrity is more of a chore; related data has been divided among a number of tables.


Denormalization results in:
 redundant data
  larger tables
  reduced performance
Seven normal forms:

First (1NF): Value stored at the intersection of each row and column must be a scalar value and table must not contain any repeating columns

Second (2NF): Every non-key column must depend on the primary key. This reduces redundancy and makes maintenance easier

(Most database designers consider a database structure to be normalized) Third normal form (3NF): Every non-key column must depend only on the primary key

### Create a table

The CREATE TABLE statement is used to create a new table in a database.


    CREATE TABLE table_name (
        column1 datatype,
        column2 datatype,
        column3 datatype,
    ....
    );


    CREATE TABLE Persons (
        Personid int NOT NULL AUTO_INCREMENT,
        LastName varchar(255) NOT NULL,
        FirstName varchar(255),
        Age int,
        PRIMARY KEY (Personid)
    );

### Show tables

Execute the following command to get a list of all tables and views in the current database

    SHOW TABLES;

### Remove a table

The DROP TABLE statement is used to drop an existing table in a database.

    DROP TABLE table_name;

# Modifying data


## UPDATE

Modify data in one or more rows of a table. Can modify a specific row or multiple rows

	UPDATE table_name
	SET column_name1=expression_1
	WHERE search_condition
	UPDATE inhabitant 
    SET name = 'Reb' WHERE personid = 20

## Alter table data

The ALTER TABLE statement is used to add, delete, or modify columns in an existing table. The ALTER TABLE statement is also used to add and drop various constraints on an existing table.

### Alter/Modify a column

To change the data type of a column in a table, use the following syntax:
 
    ALTER TABLE table_name
    MODIFY COLUMN column_name datatype; 

### Remove a column

    ALTER TABLE table_name
    DROP COLUMN column_name;

# Storing and retrieving data

## SELECT statements

The SELECT statement is used to select data from a database.

The data returned is stored in a result table, called the result-set.

    SELECT column1, column2, ...
    FROM table_name;

### The Five Clauses of the SELECT Statement

	SELECT select_list
	FROM table_source
	WHERE search_condition
	[GROUP BY group_by_list]
	[HAVING search_condition]
	[ORDER BY order_by_list]


SELECT: Describe the columns in the result set

FROM: Names the base table from which the query gets the data

WHERE: Specifies conditions that must be met for row to be included in the dataset. Consists of boolean expressions

ORDER BY: How to sort the data set

LIMIT: Specifies # of rows to return

#### WHERE Clause

The WHERE clause is used to filter records.

It is used to extract only those records that fulfill a specified condition.

    SELECT column1, column2, ...
    FROM table_name
    WHERE condition;


##### Example

Invoices that are equal to 95

    SELECT
        invoice_total
    FROM
        invoices
    WHERE
        invoice_total = 95;

Invoices that are less than 95

    SELECT
        invoice_total
    FROM
        invoices
    WHERE
        invoice_total < 95;

Invoices that are more than 95

    SELECT
        invoice_total
    FROM
        invoices
    WHERE
        invoice_total > 95;

### Limit

Gives first five of results (doesn’t dictate order)

    SELECT
        *
    FROM
        vendors
    LIMIT
        5

### ORDER BY

Allows you to sort alphabetically by a field. Note: You can sort by a field even if it’s not on the table

**How to Sort alphabetically by vendor name**
    
    
    SELECT
        vendor_name,
        vendor_zip_code
    FROM
        vendors
    ORDER BY vendor_name


**Sorts in reverse alphabetical order**

    SELECT
        vendor_name,
        vendor_zip_code
    FROM
        vendors
    ORDER BY vendor_name DESC


**You can also sort my multiple fields and by specific subparts of those fields**

This shows how to sort by the last three letters in the name and then by the id

    select name from students where marks>75

    order by substr(name, -3, 3), id;

## SQL Keywords

#### Alias 

SQL aliases are used to give a table, or a column in a table, a temporary name.

Aliases are often used to make column names more readable.

An alias only exists for the duration of that query.

An alias is created with the AS keyword.

In the following statement, we change the name of the invoices total + payment_total column to display as “addedUP.”

If you assign an alias to a table, you must use that alias to refer to the table throughout your query

    SELECT 
        invoice_total, 
        payment_total, 
        invoice_total+payment_total AS addedUP
    FROM invoices;

v\'''
WHEN month = 'Feb' 
THEN 'Feb-Revenue' 
WHEN month = 'Mar' 
THEN 'Mar_Revenue' 
WHEN month = 'Apr' 
THEN 'Apr_Revenue' 
'

## INSERT

Adds new rows to a table
     
     INSERT INTO table_name (column1, column2, column3, ...)

## How to code the GROUP BY and HAVING clauses

GROUP BY groups the rows of a result set based on one or more columns or expressions

HAVING lets you specify a search condition for a group or an aggregate 


### example

Let’s find the number of classes with more than five students.

	SELECT class
	FROM Courses
	GROUP BY class
	HAVING COUNT(student) >4

## How to use WITH ROLLUP  

The ROLLUP is an extension of the GROUP BY clause.  WITH ROLLUP operator in the GROUP BY clause to add summary rows to the final result set. The row summarizes the aggregate columns in the result set 


SQL ROLLUP with partial rollup example
You can use ROLLUP to perform a partial roll-up that reduces the number of subtotals calculated as shown in the following example:

## The SQL SELECT DISTINCT Statement

The SELECT DISTINCT statement is used to return only distinct (different) values.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.

The following SQL statement selects all (including the duplicates) values from the "Country" column in the "Customers" table:

	SELECT Country FROM Customers;

The following SQL statement lists the number of different (distinct) customer countries:

	SELECT COUNT(DISTINCT Country) FROM Customers;

### CASE statement


A SQL CASE statement evaluates and returns results based on particular values, predicates and conditions as per defined logic. For example, suppose you have a voters table with the following details:

Voter ID
Name
DOB
If you were looking for logic about voting eligibility, this would be dependent upon the values in the DOB column.

If a voter’s age is greater than 18, they are eligible to vote.

More about Case statements [here](https://blog.quest.com/sql-case-statement-what-is-it-and-what-are-the-best-ways-to-use-it/)


#### Syntax
	
	CASE input_expression,
		WHEN when_expression_1 THEN result_expression_1
		WHEN when_expression_1 THEN result_expression_2
		ELSE else_result_expression


#### Examples

	SELECT player_name, weight,
       		CASE WHEN weight > 250 THEN 'over 250'
            	WHEN weight > 200 THEN '201-250'
            	WHEN weight > 175 THEN '176-200'
            	ELSE '175 or under' END AS weight_group
  	FROM benn.college_football_players



	SELECT Name,
	CASE WHEN Occupation LIKE 'P%' THEN"(P)"
    		WHEN Occupation LIKE 'D%' THEN "(D)"
    		WHEN Occupation LIKE 'S%' THEN "(S)"
    	ELSE "(A)" END AS occupation_search
	FROM Occupations;

#### Examples

You can use case statements in SELECT

	SELECT CASE WHEN marks > 69 THEN name ELSE 'NULL' END AS name_case,
	grade, marks
	FROM students LEFT JOIN grades ON students.marks BETWEEN min_mark AND max_mark
	ORDER BY grade DESC, name;

## SQL JOINS

A JOIN clause is used to combine rows from two or more tables, based on a related column between them.

- Right Join
- Left (Outer) Join
- Full (Outer) Join
- Inner Join
- Self Join


*Joins from multiple tables*

Multi table joins are basically a series of two-table joins from left to right 

![Different types of joins](https://www.dofactory.com/img/sql/sql-joins.png)

### Table Alias

Table alias is an alternative table name assigned in the FROM clause (usually just a letter or two)- makes SQL statement easier to read

    SELECT invoice_number, vendor_name
    FROM vendors v INNER JOIN invoices i
        ON v.vendor_id = i.vendor_id
    ORDER BY invoice_number

## Inner Join

### Syntax

	SELECT column_name(s)
	FROM table1
	INNER JOIN table2
	ON table1.column_name = table2.column_name;	

### Example

The following SQL statement selects all orders with customer information:

	SELECT Orders.OrderID, Customers.CustomerName
	FROM Orders
	INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID;

Note: The INNER JOIN keyword selects all rows from both tables as long as there is a match between the columns. If there are records in the "Orders" table that do not have matches in "Customers", these orders will not be shown!

## Left (Outer) Join

The LEFT JOIN keyword returns all records from the left table (table1), and the matching records from the right table (table2). The result is 0 records from the right side, if there is no match.

- Retrieves all rows that satisfy the join condition plus unmatched rows in the left or right table
- When a row with unmatched columns is retrieved columns from opposite table that are included are given null values

### Syntax

	SELECT column_name(s)
	FROM table1
	LEFT JOIN table2
	ON table1.column_name = table2.column_name;

### Example

	SELECT Customers.CustomerName, Orders.OrderID
	FROM Customers
	LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
	ORDER BY Customers.CustomerName;

The LEFT JOIN keyword returns all records from the left table (Customers), even if there are no matches in the right table (Orders).


### How to select all records from one table that do not exist in another table


	SELECT t1.name
	FROM table1 t1
	LEFT JOIN table2 t2 ON t2.name = t1.name
	WHERE t2.name IS NULL

#### Example

Customers Who Never Ordered

	SELECT t1.name AS "Customers"
	FROM customers t1
	LEFT JOIN orders t2 ON t2.customerID = t1.id
	WHERE t2.customerID IS NULL

## Right Join

The RIGHT JOIN keyword returns all records from the right table (table2), and the matching records from the left table (table1). The result is 0 records from the left side, if there is no match

### Syntax

	SELECT column_name(s)
	FROM table1
	RIGHT JOIN table2
	ON table1.column_name = table2.column_namel

### Example

The following SQL statement will return all employees, and any orders they might have placed:

	SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
	FROM Orders
	RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
	ORDER BY Orders.OrderID;

The RIGHT JOIN keyword returns all records from the right table (Employees), even if there are no matches in the left table (Orders).

## Self Join

A self-join joins a table to itself Rare but useful for retrieving data that can’t be accessed another way. 

A self join allows you to join a table to itself. It helps query hierarchical data or compare rows within the same table.

When you code a self-join, you must uses aliases for the tables and qualify each column name with an alias 


### Syntax

	SELECT column_name(s)
	FROM table1 T1, table1 T2
	WHERE condition;

### Example

The following SQL statement matches customers that are from the same city:


	SELECT A.CustomerName AS CustomerName1, B.CustomerName AS CustomerName2, A.City
	FROM Customers A, Customers B
	WHERE A.CustomerID <> B.CustomerID
	AND A.City = B.City
	ORDER BY A.City;

## UNION

The UNION operator is used to combine the result-set of two or more SELECT statements.

- Every SELECT statement within UNION must have the same number of columns
- The columns must also have similar data types
- The columns in every SELECT statement must also be in the same order

UNION Syntax

   SELECT column_name(s) FROM table1
   UNION
   SELECT column_name(s) FROM table2;

## Using comparison operators with joins

you can enter any type of conditional statement into the ON clause. 

Here's an example using > to join only investments that occurred more than 5 years after each company's founding year:

    SELECT companies.permalink,
        companies.name,
        companies.status,
        COUNT(investments.investor_permalink) AS investors
    FROM tutorial.crunchbase_companies companies
    LEFT JOIN tutorial.crunchbase_investments_part1 investments
        ON companies.permalink = investments.company_permalink
    AND investments.funded_year > companies.founded_year + 5
    GROUP BY 1,2, 3

## Operators

An SQL operator is a special word or character used to perform tasks. These tasks can be anything from complex comparisons, to basic arithmetic operations. Think of an SQL operator as similar to how the different buttons on a calculator function.

SQL operators are primarily used within the WHERE clause of an SQL statement. This is the part of the statement that is used to filter data by a specific condition or conditions.

[More about operators here](https://www.dataquest.io/blog/sql-operators/)

### Six types of operators

Arithmetic

Bitwise

Comparison

Compound

Logical

String

## Arithmetic operators

When MySQL evaluates an arithmetic expression, it performs the operations from left to right in order of precedence - use parentheses if you want it to follow a different order

![Math operators](https://slideplayer.com/3491691/12/images/slide_1.jpg)

### Add

    SELECT 
        invoice_total, 
        payment_total, 
        invoice_total+payment_total 
    FROM invoices;

## Logical operators

Logical operators are those that return true or false, such as the AND operator, which returns true when both expressions are met.


AND: Requires all statements you include to be true

OR: Requires one statement you include to be true

NOT: Requires none of the statements to be true

#### Examples

**Payment total is equal to 0 AND invoice_total is greater than $100**
    
    SELECT
        invoice_total,
        payment_total
    FROM
        invoices
    WHERE
        payment_total = 0 AND invoice_total > 100;

**Payment total is equal to 0 OR invoice_total is greater than $100 - either can be true**    
    
    SELECT
        invoice_total,
        payment_total
    FROM
        invoices
    WHERE
        payment_total = 0 OR invoice_total > 100;

**Payment total is equal to 0 AND invoice_total is NOT greater than $100- shows any outstanding invoices that are less than $100**
    
    SELECT 
        invoice_total, payment_total 
    FROM 
        invoices 
    WHERE 
        payment_total = 0 AND NOT invoice_total > 100;

**Shows invoices that are more than $100 and less than $200**

    SELECT
        invoice_total
    FROM
        invoices
    WHERE
        invoice_total > 100 AND invoice_total < 200;

### ROUND Operator

Returns the number rounded to the precision specified by length. If length is 0 the decimal digits are omitted.

  ROUND (number[,length]

Round the number to 2 decimal places:


  SELECT ROUND(235.415, 2) AS RoundValue;

### The SQL LIKE Operator
The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

 The percent sign (%) represents zero, one, or multiple characters
 The underscore sign (_) represents one, single character


	SELECT column1, column2, ...
	FROM table_name
	WHERE columnN LIKE pattern;

### LIKE Operator						Description
	WHERE CustomerName LIKE 'a%'	Finds any values that start with "a"
	WHERE CustomerName LIKE '%a'	Finds any values that end with "a"
	WHERE CustomerName LIKE '%or%'	Finds any values that have "or" in any position
	WHERE CustomerName LIKE '_r%'	Finds any values that have "r" in the second position
	WHERE CustomerName LIKE 'a_%'	Finds any values that start with "a" and are at least 2 characters in length
	WHERE CustomerName LIKE 'a__%'	Finds any values that start with "a" and are at least 3 characters in length
	WHERE ContactName LIKE 'a%o'	Finds any values that start with "a" and ends with "o"

### REGEXP

A regular expression in standard query language (SQL) is a special rule that is used to define or describe a search pattern or characters that a particular expression can hold. 

For example, a phone number can only have 10 digits, so in order to check if a string of numbers is a phone number or not, we can create a regular expression for it. It is an in-built specification supported in almost all SQL databases.

'%' Matches any string of zero or more characters
'-' Matches any single character

Matches Santa Ana or Sacramento
    WHERE vendor_city REGEXP ‘^SA’  

How to match any record that doesn’t have a description with a value of 'boring'

    SELECT id, movie, description, rating FROM Cinema
    WHERE id % 2 != 0 AND description NOT REGEXP 'boring'
    ORDER BY rating DESC

## Functions in MySQL

MySQL can do much more than just store and retrieve data. We can also perform manipulations on the data before retrieving or saving it. 

That’s where MySQL Functions come in. Functions are simply pieces of code that perform some operations and then return a result. Some functions accept parameters while other functions do not accept parameters.

- Strings functions: operate on string data types
- Numeric functions: operate on numeric data types
- Date functions: operate on date data types
- Aggregate functions: operate on all of the above data types and produce summarized result sets.
- Analytic functions: An analytic function computes values over a group of rows and returns a single result for each row.

### String function

#### concat ()

The CONCAT() function adds two or more strings together.

	SELECT CONCAT('SQL', ' is', ' fun!');
	
	SQL is fun!

#### SUBSTRING()

The SUBSTRING() function extracts some characters from a string.


    SELECT SUBSTRING('SQL Tutorial', 1, 3) AS ExtractString;

    SQL

### Aggregate functions

An aggregate function performs a calculation on a set of values, and returns a single value. Except for COUNT(*), aggregate functions ignore null values. Aggregate functions are often used with the GROUP BY clause of the SELECT statement.

#### AVG

The AVG() function returns the average value of a numeric column. 

The following SQL statement finds the average price of all products:

	SELECT AVG(Price)
	FROM Products;

##### How to Filter Records with Aggregate Function AVG

You want to find groups of rows in which the average of values in a column is higher or lower than a given value.

	SELECT name, AVG(price)
	FROM product
	GROUP BY name
	HAVING AVG(price)>3.00;

#### MAX

Our database has a table named student with data in the following columns: id, first_name, last_name, and grade.

	id	first_name	last_name	grade
	1	Lisa		Jackson		3
	2	Gary		Larry		5
	3	Tom			Michelin	2
	4	Martin		Barker		2
	5	Ellie		Black		5
	6	Mary		Simpson		4

Let’s find the students who have the highest grades.


	SELECT  id, first_name, last_name, grade
	FROM student
	WHERE grade = (SELECT MAX(grade) FROM student);


#### MIN

You want to find rows that store the smallest numeric value in a column.

Our database has a table named weather with data in the following columns: id, city, and temperature.

	id	city		temperature
	1	Houston		23
	2	Atlanta		20
	3	Boston		15
	4	Cleveland	15
	5	Dallas		34
	6	Austin		28

Here’s how to find cities with the lowest temperature.


	SELECT  id, city, temperature
	FROM weather
	WHERE temperature = (SELECT MIN(temperature) FROM weather);

##### SUM

The SUM() function returns the total sum of a numeric column. 

The following SQL statement finds the sum of the "Quantity" fields in the "OrderDetails" table:

	SELECT SUM(Quantity)
	FROM OrderDetails;

##### How to Filter Records with Aggregate Function SUM

You need to find rows in which groups have a sum of values in one column less than a given value.

Let’s find the names of departments that have sums of salaries of its employees less than 7000.

Our database has a table named company with data in the following columns: id, department, first_name, last_name, and salary.

	id	department	first_name	last_name	salary
	1	marketing	Lora		Brown		2300
	2	finance		John		Jackson		3200
	3	marketing	Michael		Thomson		1270
	4	production	Tony		Miller		6500
	5	production	Sally		Green		2500
	6	finance		Olivier		Black		3450
	7	production	Jeniffer	Michelin	2800
	8	marketing	Jeremy		Lorson		3600
	9	marketing	Louis		Smith		4200

Let’s find the names of departments that have sums of salaries of its employees less than 7000.


	SELECT department, SUM(salary)
	FROM company
	GROUP BY department
	HAVING SUM(salary)<7000;


### COUNT

The COUNT() function returns the number of rows that matches a specified criterion.

The following SQL statement finds the number of products:

	SELECT COUNT(ProductID)
	FROM Products;

#### How to Filter Records with Aggregate Function COUNT

You want to find groups of rows with a specific number of entries in a group.

Our database has a table named product with data in the following columns: id, name and category.

	id	name		category
	1	sofa		furniture
	2	gloves		clothing
	3	T-Shirt		clothing
	4	chair		furniture
	5	desk		furniture
	6	watch		electronics
	7	armchair	furniture
	8	skirt		clothing
	9	radio 		electronics

Let’s find the category of products with more than two entries.

	SELECT category, COUNT(id)
	FROM product
	GROUP BY category
	HAVING COUNT(id)>2;

## Subqueries

Subquery is a SELECT coded within another SQL statement. Can be introduced using WHERE, HAVING, FROM or SELECT 

 
### Subqueries

	SELECT invoice_number, invoice_date, invoice_total
	FROM invoices
	WHERE invoice_total> 
		(SELECT AVG(invoice_total) 
		FROM invoices)
	ORDER BY invoice_total

#### When to use subqueries 

Most subqueries can be restated as joins and most joins can be restated as subqueries

#### Advantages of joins:

- SELECT clause of a join can include columns from both tables

- A join tends to be more intuitive when it uses an existing relationship between the two tables, such as a primary key to a foreign key relationship

#### Advantages of subqueries

- You can use a subquery to pas an aggregate value to the main query

- A subquery tends to be more intuitive when it uses an ad hoc relationship between the two tables

- Long, complex queries can sometimes be easier to code using subqueries

## Analytic functions

An analytic function computes values over a group of rows and returns a single result for each row. This is different from an aggregate function, which returns a single result for a group of rows. 

[More about analytic functions here](https://cloud.google.com/bigquery/docs/reference/standard-sql/analytic-function-concepts)

### IF function

Return "YES" if the condition is TRUE, or "NO" if the condition is FALSE:

    IF(condition, value_if_true, value_if_false)

#### Example

Return "MORE" if the condition is TRUE, or "LESS" if the condition is FALSE:

    SELECT OrderID, Quantity, IF(Quantity>10, "MORE", "LESS")
    FROM OrderDetails;

### LEAD and LAG functions

Allow you to refer to values in other rows of the result set.

#### LAG function

## Partitioning in MySQL

Partitioning is a way in which a database (MySQL in this case) splits its actual data down into separate tables, but still get treated as a single table by the SQL layer.

# Misc items

## Common table expressions

CTE stands for common table expression. A CTE allows you to define a temporary named result set that available temporarily in the execution scope of a statement such as SELECT, INSERT, UPDATE, DELETE, or MERGE.

    WITH expression_name[(column_name [,...])]
    AS
        (CTE_definition)
    SQL_statement;